FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_SD_MMC.c
/** @brief  SDIO DMA descriptor control (des0) register defines
 */
#define MCI_DMADES0_OWN         (1UL << 31)     /*!< DMA owns descriptor bit */
#define MCI_DMADES0_CES         (1 << 30)       /*!< Card Error Summary bit */
#define MCI_DMADES0_ER          (1 << 5)        /*!< End of descriptopr ring bit */
#define MCI_DMADES0_CH          (1 << 4)        /*!< Second address chained bit */
#define MCI_DMADES0_FS          (1 << 3)        /*!< First descriptor bit */
#define MCI_DMADES0_LD          (1 << 2)        /*!< Last descriptor bit */
#define MCI_DMADES0_DIC         (1 << 1)        /*!< Disable interrupt on completion bit */

/** @brief  SDIO DMA descriptor size (des1) register defines
 */
#define MCI_DMADES1_BS1(x)      (x)             /*!< Size of buffer 1 */
#define MCI_DMADES1_BS2(x)      ((x) << 13)     /*!< Size of buffer 2 */
#define MCI_DMADES1_MAXTR       4096            /*!< Max transfer size per buffer */

/** @brief SDIO Clock divider register defines
 */
#define MCI_CLOCK_DIVIDER(dn, d2) ((d2) << ((dn) * 8))  /*!< Set cklock divider */

/** @brief  SDIO device type
 */
#define TRANSFER_STATUS_READING             0x01
#define TRANSFER_STATUS_WRITING             0x02
#define TRANSFER_STATUS_BUFFER_OVERRUN      0x04
#define TRANSFER_STATUS_SD_MMC_ERROR           0x08
#define TRANSFER_STATUS_DONE                0x10
#define TRANSFER_STATUS_ANY_ERROR   \
    (TRANSFER_STATUS_BUFFER_OVERRUN|TRANSFER_STATUS_SD_MMC_ERROR)

/*-------------------------------------------------------------------------*
 * Types:
 *-------------------------------------------------------------------------*/
typedef struct {
    /* MCI_IRQ_CB_FUNC_T irq_cb; */
        LPC546xx_SD_MMC_DMADescriptor mci_dma_dd[1 + (0x10000 / MCI_DMADES1_MAXTR)];
    /* uint32_t sdio_clk_rate; */
    /* uint32_t sdif_slot_clk_rate; */
    /* int32_t clock_enabled; */
} LPC546xx_SD_MMC_DMAArea;

/*-------------------------------------------------------------------------*
 * Workspace:
 *-------------------------------------------------------------------------*/
typedef struct {
    const HAL_SD_MMC *iHAL;

    T_uezGPIOPortPin iCardDetect;
    T_uezGPIOPortPin iWriteProtect;

    LPC546xx_SD_MMC_DMAArea iDMAArea;

    T_SD_MMCReceptionComplete iReceptionCompleteCallback;
    void *iReceptionCompleteCallbackWorkspace;

    T_SD_MMCTransmissionComplete iTransmissionCompleteCallback;
    void *iTransmissionCompleteCallbackWorkspace;

    TUInt32 iRCA;       // Relative Card Address

    TUInt32 iSpeed;     // Speed of clock rate in Hz

    volatile TUInt8 sdio_wait_exit;
} T_LPC546xx_SD_MMC_Workspace;

T_LPC546xx_SD_MMC_Workspace *G_SD_MMCWorkspace;
static TUInt32 G_SourceClkFrequency;

/*-------------------------------------------------------------------------*
 * Prototypes:
 *-------------------------------------------------------------------------*/
void LPC546xx_SD_MMC_ProcessInterrupt(T_LPC546xx_SD_MMC_Workspace *p);

/*---------------------------------------------------------------------------*
 * Interrupt:  LPC546xx_SD_MMC_Interrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      A SD_MMC Interrupt has come in.  Process the one workspace attached
 *      to this interrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(LPC546xx_SD_MMC_Interrupt)
{
    IRQ_START();
    LPC546xx_SD_MMC_ProcessInterrupt(G_SD_MMCWorkspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Process an interrupt for this workspace
 * Inputs:
 *      void *aWorkspace          -- SD_MMC Workspace
 * Outputs:
 *      void
 *---------------------------------------------------------------------------*/
void LPC546xx_SD_MMC_ProcessInterrupt(T_LPC546xx_SD_MMC_Workspace *p)
{
    InterruptDisable(SDIO_IRQn);

    // Did we finish a DMA?
    if (SDIF->RINTSTS & MCI_INT_DATA_OVER) {
        // Clear the data transfer complete flag
        SDIF->RINTSTS = MCI_INT_DATA_OVER;
        // We doing a reception callback?  You only get one
        if (p->iReceptionCompleteCallback) {
            p->iReceptionCompleteCallback(p->iReceptionCompleteCallbackWorkspace);
            p->iReceptionCompleteCallback = 0;
        }

        // We doing a transmission callback?  You only get one.
        if (p->iTransmissionCompleteCallback) {
            p->iTransmissionCompleteCallback(p->iTransmissionCompleteCallbackWorkspace);
            p->iTransmissionCompleteCallback = 0;
        }
    }
    if (SDIF->RINTSTS & MCI_INT_CMD_DONE) {
        //SDIF->RINTSTS = MCI_INT_CMD_DONE;
        if (p->sdio_wait_exit != 0) {
            // Set this interrupt for SDIO commands
            p->sdio_wait_exit = 2;
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SD_MMC_InitializeWorkspace(void *aWorkspace)
{
    T_LPC546xx_SD_MMC_Workspace *p = (T_LPC546xx_SD_MMC_Workspace *)aWorkspace;
    p->iHAL = &LPC546xx_SD_MMC_Interface;

    p->iCardDetect = GPIO_NONE;
    p->iWriteProtect = GPIO_NONE;
    p->iReceptionCompleteCallback = 0;
    p->iReceptionCompleteCallbackWorkspace = 0;
    p->iTransmissionCompleteCallback = 0;
    p->iTransmissionCompleteCallbackWorkspace = 0;
    p->iRCA = 0;
    p->sdio_wait_exit = 0;

    G_SD_MMCWorkspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_PowerOn
 *---------------------------------------------------------------------------*
 * Description:
 *      Have the SD_MMC power on the target
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SD_MMC_PowerOn(void *aWorkspace)
{
    // Turn on the power (if not already on), wait 10 ms minimum,
    // and then enable the signals
    SDIF->PWREN = 0x01;
    UEZTaskDelay(10);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_PowerOff
 *---------------------------------------------------------------------------*
 * Description:
 *      Have the SD_MMC power off the target
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SD_MMC_PowerOff(void *aWorkspace)
{
    SDIF->INTMASK = 0;
    SDIF->CTRL   &= ~(1<<4);
    SDIF->CTRL = 1;
    SDIF->RINTSTS = 0xFFFFFFFF;

    SDIF->PWREN = 0x00;
    SDIF->CLKENA = 0;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_Reset
 *---------------------------------------------------------------------------*
 * Description:
 *      Reset the SD_MMC Controller
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SD_MMC_Reset(void *aWorkspace)
{
    /* Software reset */
    SDIF->BMOD = MCI_BMOD_SWR;

    /* reset all blocks */
    SDIF->CTRL = MCI_CTRL_RESET | MCI_CTRL_FIFO_RESET | MCI_CTRL_DMA_RESET;
    while (SDIF->CTRL & (MCI_CTRL_RESET | MCI_CTRL_FIFO_RESET | MCI_CTRL_DMA_RESET))
        {}

