FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_SD_MMC.c
    /* Internal DMA setup for control register */
    SDIF->CTRL = MCI_CTRL_USE_INT_DMAC | MCI_CTRL_INT_ENABLE;
    SDIF->INTMASK = 0;

    /* Clear the interrupts for the host controller */
    SDIF->RINTSTS = 0xFFFFFFFF;

    /* Put in max timeout */
    SDIF->TMOUT = 0xFFFFFFFF;

    /* FIFO threshold settings for DMA, DMA burst of 4,   FIFO watermark at 16 */
    SDIF->FIFOTH = MCI_FIFOTH_DMA_MTS_4 | MCI_FIFOTH_RX_WM((SD_FIFO_SZ / 2) - 1) | MCI_FIFOTH_TX_WM(SD_FIFO_SZ / 2);

    /* Enable internal DMA, burst size of 4, fixed burst */
    SDIF->BMOD = MCI_BMOD_DE | MCI_BMOD_PBL4 | MCI_BMOD_DSL(4);

    /* disable clock to CIU (needs latch) */
    SDIF->CLKENA = 0;
    //SDIF->CLKSRC = 0;
    SYSCON->SDIOCLKSEL = 0;

    return UEZ_ERROR_NONE;
}

static int ISendCommand(unsigned int aCommand, unsigned int aArgument)
{
    volatile int32_t timeout = 50;
    volatile int delay; // very fast delays

    // Set command argument
    SDIF->CMDARG = aArgument;
    SDIF->CMD = MCI_CMD_START | aCommand;

    // Poll until accepted
    while (--timeout && (SDIF->CMD & MCI_CMD_START)) {
        if (timeout & 1) {
            delay = 50;
        }
        else {
            delay = 18000;
        }

        while (--delay > 1) {}
    }

    return (timeout < 1) ? 1 : 0;
}

/* Read the response from the last command */
static void IGetResponse(uint32_t *resp)
{
    /* on this chip response is not a fifo so read all 4 regs */
    resp[0] = SDIF->RESP[0];
    resp[1] = SDIF->RESP[1];
    resp[2] = SDIF->RESP[2];
    resp[3] = SDIF->RESP[3];
}

/* Setup DMA descriptors */
void ISetupDMA(LPC546xx_SD_MMC_DMAArea *aDMAArea, TUInt32 addr, TUInt32 size)
{
    int i = 0;
    TUInt32 ctrl, maxs;

    // Reset DMA
    SDIF->CTRL |= MCI_CTRL_DMA_RESET | MCI_CTRL_FIFO_RESET;
    while (SDIF->CTRL & MCI_CTRL_DMA_RESET) {
    }

    // Build a descriptor list using the chained DMA method
    while (size > 0) {
        // Limit size of the transfer to maximum buffer size
        maxs = size;
        if (maxs > MCI_DMADES1_MAXTR) {
            maxs = MCI_DMADES1_MAXTR;
        }
        size -= maxs;

        /* Set buffer size */
        aDMAArea->mci_dma_dd[i].des1 = MCI_DMADES1_BS1(maxs);

        // Setup buffer address (chained)
        aDMAArea->mci_dma_dd[i].des2 = addr + (i * MCI_DMADES1_MAXTR);

        // Setup basic control
        ctrl = MCI_DMADES0_OWN | MCI_DMADES0_CH;
        if (i == 0)
            ctrl |= MCI_DMADES0_FS; // First DMA buffer

        // No more data? Then this is the last descriptor
        if (!size) {
            ctrl |= MCI_DMADES0_LD;
        } else {
            ctrl |= MCI_DMADES0_DIC;
        }

        // Another descriptor is needed
        aDMAArea->mci_dma_dd[i].des3 = (uint32_t)&aDMAArea->mci_dma_dd[i + 1];
        aDMAArea->mci_dma_dd[i].des0 = ctrl;

        i++;
    }

    // Set DMA descriptor base address
    SDIF->DBADDR = (uint32_t)&aDMAArea->mci_dma_dd[0];
}

/* Function to clear interrupt & FIFOs */
static void ISetClearIntFifo(void)
{
    /* reset all blocks */
    SDIF->CTRL |= MCI_CTRL_FIFO_RESET;

    /* wait till resets clear */
    while (SDIF->CTRL & MCI_CTRL_FIFO_RESET) {}

    /* Clear interrupt status */
    SDIF->RINTSTS = 0xFFFFFFFF;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_ReadyTransmission
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare for a number of write block transactions.
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 *      TUInt32 aNumBlocks      -- Number of total blocks to write
 *      TUInt32 aBlockSize      -- Size of each block (only 512 supported)
 *      T_SD_MMCReceptionComplete aTranmissionCallback -- Routine to call
 *                                  when complete from interrupt.
 *      void *aTransmissionCallbackWorkspace -- Workspace for callback.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SD_MMC_ReadyTransmission(
    void *aWorkspace,
    const TUInt8 *aBuffer,
    TUInt32 aNumBlocks,
    TUInt32 aBlockSize,
    TUInt32 *aNumWriting,
    T_SD_MMCTransmissionComplete aTransmissionCallback,
    void *aTransmissionCallbackWorkspace)
{
    T_LPC546xx_SD_MMC_Workspace *p = (T_LPC546xx_SD_MMC_Workspace *)aWorkspace;
    TUInt32 numBytes;

    // This implementation only supports 512 byte blocks!
    if (aBlockSize != 512)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Determine how many blocks we are going to write (based on the
    // number requested to send and how much room we got).
    *aNumWriting = aNumBlocks;
    if (*aNumWriting >= NUM_MAX_BLOCKS)
        *aNumWriting = NUM_MAX_BLOCKS-1;
    //p->iNumWriting = *aNumWriting;

    numBytes = aBlockSize * aNumBlocks;
    SDIF->BYTCNT = numBytes;

    // Set the callback routine (if any)
    p->iTransmissionCompleteCallback = aTransmissionCallback;
    p->iTransmissionCompleteCallbackWorkspace = aTransmissionCallbackWorkspace;

    ISetupDMA(&p->iDMAArea, (TUInt32) aBuffer, aNumBlocks * aBlockSize);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_SetRelativeCardAddress
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the active RCA (Relative Card Address).
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 *      TUInt32 aRCA            -- Relative Card Address (RCA)
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SD_MMC_SetRelativeCardAddress(void *aWorkspace, TUInt32 aRCA)
{
    T_LPC546xx_SD_MMC_Workspace *p = (T_LPC546xx_SD_MMC_Workspace *)aWorkspace;
    p->iRCA = aRCA;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_SetClockRate
 *---------------------------------------------------------------------------*
 * Description:
 *      Set the clocking rate of the SD_MMC bus clock in Hz.  If power save
 *      mode is set, the clock is only run when communications is active,
 *      otherwise it is run continuously.
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 *      TUInt32 aHz             -- Clock rate in Hz.
 *      TBool aPowerSave        -- ETrue to save power by running the clock
 *                                  only when active, else EFalse to run
 *                                  clock continuously.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError ISetClockRate(
    void *aWorkspace,
    TUInt32 aHz)
{
    PARAM_NOT_USED(aWorkspace);
    //PARAM_NOT_USED(aPowerSave);

    TUInt32 clk_rate = G_SourceClkFrequency;

    // Power save means the clock ONLY runs when needed, otherwise the SD CLK
    // runs continuously.
    if (aHz == 0) {

    } else {
        /* compute SD/MCI clock dividers */
        uint32_t div;

        div = ((clk_rate / aHz)) >> 1;
        if ((div == SDIF->CLKDIV) && SDIF->CLKENA) {
            return UEZ_ERROR_NONE; /* Closest speed is already set */

