FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_SD_MMC.c
        }
        /* disable clock */
        SDIF->CLKENA = 0;

        /* User divider 0 */
        //SDIF->CLKSRC = MCI_CLKSRC_CLKDIV0;
        SYSCON->SDIOCLKSEL = 0;

        /* inform CIU */
        ISendCommand(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);

        /* set divider 0 to desired value */
        SDIF->CLKDIV = MCI_CLOCK_DIVIDER(0, div);

        /* inform CIU */
        ISendCommand(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);

        /* enable clock */
        SDIF->CLKENA = MCI_CLKEN_ENABLE;

        /* inform CIU */
        ISendCommand(MCI_CMD_UPD_CLK | MCI_CMD_PRV_DAT_WAIT, 0);
    }

    return UEZ_ERROR_NONE;
}

T_uezError LPC546xx_SD_MMC_SetClockRate(
    void *aWorkspace,
    TUInt32 aHz)
{
    T_LPC546xx_SD_MMC_Workspace *p = (T_LPC546xx_SD_MMC_Workspace *)aWorkspace;

    // Remember speed for later
    p->iSpeed = aHz;

    return UEZ_ERROR_NONE;
}

static void IEventSetup(T_LPC546xx_SD_MMC_Workspace *p, void *bits)
{
    uint32_t bit_mask = *((uint32_t *)bits);

    /* Wait for IRQ - for an RTOS, you would pend on an event here with a IRQ based wakeup. */
    NVIC_ClearPendingIRQ(SDIO_IRQn);
    p->sdio_wait_exit = 1;
    SDIF->INTMASK = bit_mask;
    InterruptEnable(SDIO_IRQn);
}

static uint32_t IIRQWait(T_LPC546xx_SD_MMC_Workspace *p)
{
    uint32_t status;

    /* Wait for event, would be nice to have a timeout, but keep it  simple */
    while (p->sdio_wait_exit != 2) {
        // Very fast wait time?
        // Spinning....
    }

    /* Get status and clear interrupts */
    status = SDIF->RINTSTS;
    SDIF->RINTSTS = status;
    SDIF->INTMASK = 0;

    return status;
}

#ifdef DEBUG_CMD
typedef struct {
      uint32_t cmd;
      uint32_t arg;
      uint32_t wait_status;
      uint32_t response[4];
} T_mmcCmd;
T_mmcCmd G_cmds[100];
int G_numCmds = 0;

static T_mmcCmd *SDMMCLog(uint32_t cmd, uint32_t arg, uint32_t wait_status)
{
  if (G_numCmds < 100) {
    T_mmcCmd *p = G_cmds + G_numCmds++;
    p->cmd = cmd;
    p->arg = arg;
    p->wait_status = wait_status;
    p->response[0] = 0;
    p->response[1] = 0;
    p->response[2] = 0;
    p->response[3] = 0;
    return p;
  }
  return 0;
}
#endif

TUInt32 LPC546xx_SD_MMC_ExecuteCommand(
            void *aWorkspace,
            TUInt32 aCommand,
            TUInt32 aArgument,
            TUInt32 aWaitStatus,
            TUInt32 *aResponse)
{
    T_LPC546xx_SD_MMC_Workspace *p = (T_LPC546xx_SD_MMC_Workspace *)aWorkspace;
    int32_t step = (aCommand & CMD_BIT_APP) ? 2 : 1;
    int32_t status = 0;
    uint32_t cmd_reg = 0;

    if (!aWaitStatus) {
        aWaitStatus = (aCommand & CMD_MASK_RESP) ? MCI_INT_CMD_DONE : MCI_INT_DATA_OVER;
    }

    // Zero out the response
    aResponse[0] = 0;
    aResponse[1] = 0;
    aResponse[2] = 0;
    aResponse[3] = 0;
#ifdef DEBUG_CMD
    T_mmcCmd *p_cmd = SDMMCLog(aCommand, aArgument, aWaitStatus);
#endif

    /* Clear the interrupts & FIFOs*/
    if (aCommand & CMD_BIT_DATA)
        ISetClearIntFifo();

    /* also check error conditions */
    aWaitStatus |= MCI_INT_EBE | MCI_INT_SBE | MCI_INT_HLE | MCI_INT_RTO | MCI_INT_RCRC | MCI_INT_RESP_ERR;
    if (aWaitStatus & MCI_INT_DATA_OVER)
        aWaitStatus |= MCI_INT_FRUN | MCI_INT_HTO | MCI_INT_DTO | MCI_INT_DCRC;

    while (step) {
        ISetClockRate(aWorkspace, p->iSpeed);

        /* Clear the interrupts */
        SDIF->RINTSTS = 0xFFFFFFFF;

        IEventSetup(p, (void *)&aWaitStatus);

        switch (step) {
            case 1: /* Execute command */
                cmd_reg = ((aCommand & CMD_MASK_CMD) >> CMD_SHIFT_CMD)
                        | ((aCommand & CMD_BIT_INIT) ? MCI_CMD_INIT : 0)
                        | ((aCommand & CMD_BIT_DATA) ? (MCI_CMD_DAT_EXP | MCI_CMD_PRV_DAT_WAIT) : 0)
                        | (((aCommand & CMD_MASK_RESP) == CMD_RESP_R2) ? MCI_CMD_RESP_LONG : 0)
                        | ((aCommand & CMD_MASK_RESP) ? MCI_CMD_RESP_EXP : 0)
                        | ((aCommand & CMD_BIT_WRITE) ? MCI_CMD_DAT_WR : 0)
                        | ((aCommand & CMD_BIT_STREAM) ? MCI_CMD_STRM_MODE : 0)
                        | ((aCommand & CMD_BIT_BUSY) ? MCI_CMD_STOP : 0)
                        | ((aCommand & CMD_BIT_AUTO_STOP) ? MCI_CMD_SEND_STOP : 0)
                        | MCI_CMD_START;

                /* wait for previos data finsh for select/deselect commands */
                if (((aCommand & CMD_MASK_CMD) >> CMD_SHIFT_CMD) == MMC_SELECT_CARD) {
                    cmd_reg |= MCI_CMD_PRV_DAT_WAIT;
                }

                /* wait for command to be accepted by CIU */
                if (ISendCommand(cmd_reg, aArgument) == 0)
                    --step;
                break;

            case 0:
                return 0;

            case 2: /* APP prefix */
                cmd_reg = MMC_APP_CMD | MCI_CMD_RESP_EXP | ((aCommand & CMD_BIT_INIT) ? MCI_CMD_INIT : 0) |
                MCI_CMD_START;

                if (ISendCommand(cmd_reg, (p->iRCA << 16)) == 0)
                    --step;
                break;
        }

        // wait for command response (does not use semaphores?)
        // Only used for fast interrupts
        status = IIRQWait(p);

        /* We return an error if there is a timeout, even if we've fetched  a response */
        if (status & SD_INT_ERROR) {
            return status;
        }

        if (status & MCI_INT_CMD_DONE) {
            switch (aCommand & CMD_MASK_RESP) {
                case 0:
                    break;

                case CMD_RESP_R1:
                case CMD_RESP_R3:
                case CMD_RESP_R2:
                    IGetResponse(aResponse);
                    break;
            }
        }
#ifdef DEBUG_CMD
        p_cmd->response[0] = aResponse[0];
        p_cmd->response[1] = aResponse[1];
        p_cmd->response[2] = aResponse[2];
        p_cmd->response[3] = aResponse[3];
#endif
    }

    return 0;
}

void LPC546xx_SD_MMC_SetCardType(void *aWorkspace, TUInt32 aType)
{
    PARAM_NOT_USED(aWorkspace);
    SDIF->CTYPE = aType;
}
void LPC546xx_SD_MMC_SetBlockSize(void *aWorkspace, TUInt32 bytes)
{
    PARAM_NOT_USED(aWorkspace);
    SDIF->BLKSIZ = bytes;
}

void LPC546xx_SD_MMC_PrepreExtCSDTransfer(void *aWorkspace, TUInt8 *aAddress, TUInt32 aTransferSize)
{
    T_LPC546xx_SD_MMC_Workspace *p = (T_LPC546xx_SD_MMC_Workspace *)aWorkspace;

    // Prepare the size
    SDIF->BLKSIZ = aTransferSize;
    SDIF->BYTCNT = aTransferSize;

    // Setup the DMA
    ISetupDMA(&p->iDMAArea, (TUInt32)aAddress, aTransferSize);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SD_MMC_ReadyReception
 *---------------------------------------------------------------------------*
 * Description:
 *      Prepare the SD_MMC Controller for receiving blocks of data of the
 *      given size (usually 512 bytes).  When each block is received, call
 *      the given callback routine.
 * Inputs:
 *      void *aWorkspace        -- SD_MMC Workspace
 *      TUInt32 aNumBlocks      -- Number of blocks to receive
 *      TUInt32 aBlockSize      -- Block size.  Should be multiple of 4 and
 *                                  a power of 2.  Currently only 512 supported.
 *      T_SD_MMCReceptionComplete aReceptionCallback - Callback routine when
 *                                  received block.
 *      void *aReceptionCallbackWorkspace -- Workspace for callback.
 *      TUInt32 aNumBlocksReady -- Number of blocks readied equal or or less
 *                                  than aNumBlocks.  Can be zero.
 * Outputs:
 *      T_uezError              -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SD_MMC_ReadyReception(
    void *aWorkspace,
    TUInt8 *aBuffer,
    TUInt32 aNumBlocks,
    TUInt32 aBlockSize,
    T_SD_MMCReceptionComplete aReceptionCallback,
    void *aCallbackWorkspace,
    TUInt32 *aNumBlocksReady)
{
    T_LPC546xx_SD_MMC_Workspace *p = (T_LPC546xx_SD_MMC_Workspace *)aWorkspace;
    TUInt32 byteCount;

    if (aNumBlocks > NUM_MAX_BLOCKS)
        aNumBlocks = NUM_MAX_BLOCKS;
    *aNumBlocksReady = aNumBlocks;

    p->iReceptionCompleteCallback = aReceptionCallback;
    p->iReceptionCompleteCallbackWorkspace = aCallbackWorkspace;

    byteCount = aNumBlocks * aBlockSize;

    // Set the number of bytes to read
    SDIF->BYTCNT = byteCount;

    ISetupDMA(&p->iDMAArea, (TUInt32) aBuffer, aNumBlocks * aBlockSize);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const HAL_SD_MMC LPC546xx_SD_MMC_Interface = { {
    "LPC546xx:SD_MMC",
    0x0204,
    LPC546xx_SD_MMC_InitializeWorkspace,
    sizeof(T_LPC546xx_SD_MMC_Workspace), },

// v2.04
    LPC546xx_SD_MMC_PowerOn,
    LPC546xx_SD_MMC_PowerOff,
    LPC546xx_SD_MMC_Reset,
    LPC546xx_SD_MMC_ExecuteCommand,
    LPC546xx_SD_MMC_ReadyReception,
    LPC546xx_SD_MMC_SetRelativeCardAddress,
    LPC546xx_SD_MMC_SetClockRate,
    LPC546xx_SD_MMC_ReadyTransmission,
    LPC546xx_SD_MMC_SetCardType,
    LPC546xx_SD_MMC_SetBlockSize,
    LPC546xx_SD_MMC_PrepreExtCSDTransfer
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC546xx_SD_MMC_Require(const T_LPC546xx_SD_MMC_Pins *aPins)
{
    T_halWorkspace *p_SD_MMC;
    T_LPC546xx_SD_MMC_Workspace *p;

    static const T_LPC546xx_ICON_ConfigList sd_cd[] = {
            {GPIO_P0_17     , IOCON_D_DEFAULT(2)}, //SD_CD    SD/MMC card detect input.
            {GPIO_P2_10     , IOCON_D_DEFAULT(2)},
            {GPIO_P4_22     , IOCON_D_DEFAULT(2)},
    };

    static const T_LPC546xx_ICON_ConfigList sd_cmd[] = {
            {GPIO_P0_8      , IOCON_D_DEFAULT(2)}, //SD_CMD   SD/MMC command signal.
            {GPIO_P1_15     , IOCON_D_DEFAULT(4)}, //SD_CMD   SD/MMC command signal.
            {GPIO_P1_22     , IOCON_D_DEFAULT(2)}, //SD_CMD   SD/MMC command signal.
            {GPIO_P2_4      , IOCON_D_DEFAULT(2)}, //SD_CMD   SD/MMC command signal.
            {GPIO_P4_20     , IOCON_D_DEFAULT(2)},
    };

