FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_SD_MMC.c
    static const T_LPC546xx_ICON_ConfigList sd_dat0[] = {
            {GPIO_P0_24     , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST}, //SD_DAT0  SD/MMC data bus line 0.
            {GPIO_P1_4      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST}, //SD_DAT0  SD/MMC data bus line 0.
            {GPIO_P2_6      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
            {GPIO_P4_25     , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
    };

    static const T_LPC546xx_ICON_ConfigList sd_dat1[] = {
            {GPIO_P0_25     , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST}, //SD_DAT1  SD/MMC data bus line 1.
            {GPIO_P1_7      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
            {GPIO_P2_7      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
            {GPIO_P4_26     , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
    };

    static const T_LPC546xx_ICON_ConfigList sd_dat2[] = {
            {GPIO_P0_31     , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST}, //SD_DAT2  SD/MMC data bus line 2.
            {GPIO_P1_5      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
            {GPIO_P2_8      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
            {GPIO_P4_27     , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
    };

    static const T_LPC546xx_ICON_ConfigList sd_dat3[] = {
            {GPIO_P1_0      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST}, //SD_DAT3  SD/MMC data bus line 3.
            {GPIO_P1_6      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
            {GPIO_P2_9      , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
            {GPIO_P4_28     , IOCON_D_DEFAULT(2) | IOCON_SLEW_FAST},
    };

    static const T_LPC546xx_ICON_ConfigList sd_pow[] = {
            {GPIO_P0_9      , IOCON_D_DEFAULT(2)},
            {GPIO_P2_5      , IOCON_D_DEFAULT(7)},
            {GPIO_P4_21     , IOCON_D_DEFAULT(2)},
    };

    static const T_LPC546xx_ICON_ConfigList sd_wp[] = {
            {GPIO_P4_23     , IOCON_D_DEFAULT(2)}, //SD_WP    SD/MMC card write protect input.
    };

    static const T_LPC546xx_ICON_ConfigList sd_clk[] = {
            {GPIO_P0_7      , IOCON_D_DEFAULT(2)}, //SD_CLK   SD/MMC card clock.
            {GPIO_P1_8      , IOCON_D_DEFAULT(2)}, //SD_CLK   SD/MMC card clock.
            {GPIO_P2_3      , IOCON_D_DEFAULT(2)},
            {GPIO_P4_19     , IOCON_D_DEFAULT(2)},
    };

    HAL_DEVICE_REQUIRE_ONCE();

    // Register SD_MMC Controller
    HALInterfaceRegister("SD_MMC",
            (T_halInterface *)&LPC546xx_SD_MMC_Interface, 0, &p_SD_MMC);
    p = (T_LPC546xx_SD_MMC_Workspace *)p_SD_MMC;

    // Turn on the SD_MMC Controller
    //clock based on PCLK
    G_SourceClkFrequency = UEZPlatform_GetPCLKFrequency();

    //Turn on SDIO Interface
    LPC546xxPowerOn(kCLOCK_Sdio);
    SYSCON->SDIOCLKSEL = 0;
    SYSCON->SDIOCLKDIV = 0;

    LPC546xx_ICON_ConfigPinOrNone(aPins->iCardDetect, sd_cd, ARRAY_COUNT(sd_cd));
    LPC546xx_ICON_ConfigPinOrNone(aPins->iCMD, sd_cmd, ARRAY_COUNT(sd_cmd));
    LPC546xx_ICON_ConfigPinOrNone(aPins->iDAT0, sd_dat0, ARRAY_COUNT(sd_dat0));
    LPC546xx_ICON_ConfigPinOrNone(aPins->iDAT1, sd_dat1, ARRAY_COUNT(sd_dat1));
    LPC546xx_ICON_ConfigPinOrNone(aPins->iDAT2, sd_dat2, ARRAY_COUNT(sd_dat2));
    LPC546xx_ICON_ConfigPinOrNone(aPins->iDAT3, sd_dat3, ARRAY_COUNT(sd_dat3));
    LPC546xx_ICON_ConfigPinOrNone(aPins->iPOW, sd_pow, ARRAY_COUNT(sd_pow));
    LPC546xx_ICON_ConfigPinOrNone(aPins->iWriteProtect, sd_wp, ARRAY_COUNT(sd_wp));
    LPC546xx_ICON_ConfigPinOrNone(aPins->iCLK, sd_clk, ARRAY_COUNT(sd_clk));

    // Reset SD_MMC Registers
    LPC546xx_SD_MMC_Reset((void *)p);

    // Setup interrupt for the SD_MMC
    InterruptRegister(SDIO_IRQn, LPC546xx_SD_MMC_Interrupt,
        INTERRUPT_PRIORITY_NORMAL, "SD_MMC");
    InterruptEnable(SDIO_IRQn);
}

/*-------------------------------------------------------------------------*
 * End of File:  LPC546xx_SD_MMC.c
 *-------------------------------------------------------------------------*/
